wookey-project/libxDCI/include_frama/socs/stm32f439/usbotghs_regs.h
/* EP 0 transmit FIFO size register */
# define USBOTG_HS_TX0FSIZ_TX0FSA_Pos        0
# define USBOTG_HS_TX0FSIZ_TX0FSA_Msk        ((uint32_t)0xffff << USBOTG_HS_TX0FSIZ_TX0FSA_Pos)
# define USBOTG_HS_TX0FSIZ_T0XFD_Pos         16
# define USBOTG_HS_TX0FSIZ_T0XFD_Msk         ((uint32_t)0xffff << USBOTG_HS_TX0FSIZ_T0XFD_Pos)

/* I2C access register */
# define USBOTG_HS_GI2CCTL_RWDATA_Pos        0
# define USBOTG_HS_GI2CCTL_RWDATA_Msk        ((uint32_t)0xff << USBOTG_HS_GIT2CCTL_RWDATA_Pos)
# define USBOTG_HS_GI2CCTL_REGADDR_Pos       8
# define USBOTG_HS_GI2CCTL_REGADDR_Msk       ((uint32_t)0xff << USBOTG_HS_GIT2CCTL_REGADDR_Pos)
# define USBOTG_HS_GI2CCTL_ADDR_Pos          16
# define USBOTG_HS_GI2CCTL_ADDR_Msk          ((uint32_t)0x7f << USBOTG_HS_GIT2CCTL_ADDR_Pos)
# define USBOTG_HS_GI2CCTL_I2CEN_Pos         23
# define USBOTG_HS_GI2CCTL_I2CEN_Msk         ((uint32_t)1 << USBOTG_HS_GIT2CCTL_I2CEN_Pos)
# define USBOTG_HS_GI2CCTL_ACK_Pos           24
# define USBOTG_HS_GI2CCTL_ACK_Msk           ((uint32_t)1 << USBOTG_HS_GIT2CCTL_ACK_Pos)
# define USBOTG_HS_GI2CCTL_I2CDEVADR_Pos     26
# define USBOTG_HS_GI2CCTL_I2CDEVADR_Msk     ((uint32_t)0x3 << USBOTG_HS_GIT2CCTL_I2CDEVADR_Pos)
# define USBOTG_HS_GI2CCTL_I2CDATSE0_Pos     28
# define USBOTG_HS_GI2CCTL_I2CDATSE0_Msk     ((uint32_t)1 << USBOTG_HS_GIT2CCTL_I2CDATSE0_Pos)
# define USBOTG_HS_GI2CCTL_RW_Pos            30
# define USBOTG_HS_GI2CCTL_RW_Msk            ((uint32_t)1 << USBOTG_HS_GIT2CCTL_RW_Pos)
# define USBOTG_HS_GI2CCTL_BSYDNE_Pos        31
# define USBOTG_HS_GI2CCTL_BSYDNE_Msk        ((uint32_t)1 << USBOTG_HS_GIT2CCTL_BSYDNE_Pos)

/* General core configuration register */
# define USBOTG_HS_GCCFG_PWRDWN_Pos          16
# define USBOTG_HS_GCCFG_PWRDWN_Msk          ((uint32_t)1 << USBOTG_HS_GCCFG_PWRDWN_Pos)
# define USBOTG_HS_GCCFG_I2CPADEN_Pos        17
# define USBOTG_HS_GCCFG_I2CPADEN_Msk        ((uint32_t)1 << USBOTG_HS_GCCFG_I2CPADEN_Pos)
# define USBOTG_HS_GCCFG_VBUSASEN_Pos        18
# define USBOTG_HS_GCCFG_VBUSASEN_Msk        ((uint32_t)1 << USBOTG_HS_GCCFG_VBUSASEN_Pos)
# define USBOTG_HS_GCCFG_VBUSBSEN_Pos        19
# define USBOTG_HS_GCCFG_VBUSBSEN_Msk        ((uint32_t)1 << USBOTG_HS_GCCFG_VBUSBSEN_Pos)
# define USBOTG_HS_GCCFG_SOFOUTEN_Pos        20
# define USBOTG_HS_GCCFG_SOFOUTEN_Msk        ((uint32_t)1 << USBOTG_HS_GCCFG_SOFOUTEN_Pos)
# define USBOTG_HS_GCCFG_NOVBUSSENS_Pos      21
# define USBOTG_HS_GCCFG_NOVBUSSENS_Msk      ((uint32_t)1 << USBOTG_HS_GCCFG_NOVBUSSENS_Pos)

/* Core ID register */
# define USBOTG_HS_CID_PRODUCT_ID_Pos        0
# define USBOTG_HS_CID_PRODUCT_ID_Msk        ((uint32_t)0xffffffff << USBOTG_HS_CID_PRODUCT_ID_Pos)

/* Device IN endpoint transmit FIFO size register */
# define USBOTG_HS_DIEPTXF_INEPTXSA_Pos      0
# define USBOTG_HS_DIEPTXF_INEPTXSA_Msk      ((uint32_t)0xffff << USBOTG_HS_DIEPTXF_INEPTXSA_Pos)
# define USBOTG_HS_DIEPTXF_INEPTXFD_Pos      16
# define USBOTG_HS_DIEPTXF_INEPTXFD_Msk      ((uint32_t)0xffff << USBOTG_HS_DIEPTXF_INEPTXFD_Pos)

/* Device configuration register */
# define USBOTG_HS_DCFG_DSPD_Pos             0
# define USBOTG_HS_DCFG_DSPD_Msk             ((uint32_t)0x3 << USBOTG_HS_DCFG_DSPD_Pos)
# define USBOTG_HS_DCFG_DSPD_HS              0
# define USBOTG_HS_DCFG_DSPD_FS_ULPI         1

# define USBOTG_HS_DCFG_DSPD_FS              3
# define USBOTG_HS_DCFG_NZLSOHSK_Pos         2
# define USBOTG_HS_DCFG_NZLSOHSK_Msk         ((uint32_t)1 << USBOTG_HS_DCFG_NZLSOHSK_Pos)
# define USBOTG_HS_DCFG_DAD_Pos              4
# define USBOTG_HS_DCFG_DAD_Msk              ((uint32_t)0x7f << USBOTG_HS_DCFG_DAD_Pos)
# define USBOTG_HS_DCFG_PFIVL_Pos            11
# define USBOTG_HS_DCFG_PFIVL_Msk            ((uint32_t)0x3 << USBOTG_HS_DCFG_DAD_Pos)
#    define USBOTG_HS_DCFG_PFIVL_INTERVAL_80 0
#    define USBOTG_HS_DCFG_PFIVL_INTERVAL_85 1
#    define USBOTG_HS_DCFG_PFIVL_INTERVAL_90 2
#    define USBOTG_HS_DCFG_PFIVL_INTERVAL_95 3
# define USBOTG_HS_DCFG_PERSCHIVL_Pos        24
# define USBOTG_HS_DCFG_PERSCHIVL_Msk        ((uint32_t)0x3 << USBOTG_HS_DCFG_DAD_Pos)

/* Device control register */
# define USBOTG_HS_DCTL_RWUSIG_Pos           0
# define USBOTG_HS_DCTL_RWUSIG_Msk           ((uint32_t)1 << USBOTG_HS_DCTL_RWUSIG_Pos)
# define USBOTG_HS_DCTL_SDIS_Pos             1
# define USBOTG_HS_DCTL_SDIS_Msk             ((uint32_t)1 << USBOTG_HS_DCTL_SDIS_Pos)
# define USBOTG_HS_DCTL_GINSTS_Pos           2
# define USBOTG_HS_DCTL_GINSTS_Msk           ((uint32_t)1 << USBOTG_HS_DCTL_GINSTS_Pos)
# define USBOTG_HS_DCTL_GONSTS_Pos           3
# define USBOTG_HS_DCTL_GONSTS_Msk           ((uint32_t)1 << USBOTG_HS_DCTL_GONSTS_Pos)
# define USBOTG_HS_DCTL_TCTL_Pos             4
# define USBOTG_HS_DCTL_TCTL_Msk             ((uint32_t)0x7 << USBOTG_HS_DCTL_TCTL_Pos)
# define USBOTG_HS_DCTL_SGINAK_Pos           7
# define USBOTG_HS_DCTL_SGINAK_Msk           ((uint32_t)1 << USBOTG_HS_DCTL_SGINAK_Pos)
# define USBOTG_HS_DCTL_CGINAK_Pos           8
# define USBOTG_HS_DCTL_CGINAK_Msk           ((uint32_t)1 << USBOTG_HS_DCTL_CGINAK_Pos)
# define USBOTG_HS_DCTL_SGONAK_Pos           9
# define USBOTG_HS_DCTL_SGONAK_Msk           ((uint32_t)1 << USBOTG_HS_DCTL_SGONAK_Pos)
# define USBOTG_HS_DCTL_CGONAK_Pos           10
# define USBOTG_HS_DCTL_CGONAK_Msk           ((uint32_t)1 << USBOTG_HS_DCTL_CGONAK_Pos)
# define USBOTG_HS_DCTL_POPRGDNE_Pos         11
# define USBOTG_HS_DCTL_POPRGDNE_Msk         ((uint32_t)1 << USBOTG_HS_DCTL_POPRGDNE_Pos)

/* Device status register */
# define USBOTG_HS_DSTS_SUSPSTS_Pos          0
# define USBOTG_HS_DSTS_SUSPSTS_Msk          ((uint32_t)1 << USBOTG_HS_DSTS_SUSPSTS_Pos)
# define USBOTG_HS_DSTS_ENUMSPD_Pos          1
# define USBOTG_HS_DSTS_ENUMSPD_Msk          ((uint32_t)0x3 << USBOTG_HS_DSTS_ENUMSPD_Pos)
#    define USBOTG_HS_DSTS_ENUMSPD_HS        ((uint8_t)0)
#    define USBOTG_HS_DSTS_ENUMSPD_FS        ((uint8_t)3)
# define USBOTG_HS_DSTS_EERR_Pos             3
# define USBOTG_HS_DSTS_EERR_Msk             ((uint32_t)1 << USBOTG_HS_DSTS_EERR_Pos)
# define USBOTG_HS_DSTS_FNSOF_Pos            8
# define USBOTG_HS_DSTS_FNSOF_Msk            ((uint32_t)0x3fff << USBOTG_HS_DSTS_FNSOF_Pos)

/* Device IN enpoint common interrupt mask register */
# define USBOTG_HS_DIEPMSK_XFRCM_Pos         0
# define USBOTG_HS_DIEPMSK_XFRCM_Msk         ((uint32_t)1 << USBOTG_HS_DIEPMSK_XFRCM_Pos)
# define USBOTG_HS_DIEPMSK_EPDM_Pos          1
# define USBOTG_HS_DIEPMSK_EPDM_Msk          ((uint32_t)1 << USBOTG_HS_DIEPMSK_EPDM_Pos)
# define USBOTG_HS_DIEPMSK_TOM_Pos           3
# define USBOTG_HS_DIEPMSK_TOM_Msk           ((uint32_t)1 << USBOTG_HS_DIEPMSK_TOM_Pos)
# define USBOTG_HS_DIEPMSK_ITTXFEMSK_Pos     4
# define USBOTG_HS_DIEPMSK_ITTXFEMSK_Msk     ((uint32_t)1 << USBOTG_HS_DIEPMSK_ITTXFEMSK_Pos)
# define USBOTG_HS_DIEPMSK_INEPNMM_Pos       5
# define USBOTG_HS_DIEPMSK_INEPNMM_Msk       ((uint32_t)1 << USBOTG_HS_DIEPMSK_INEPNMM_Pos)
# define USBOTG_HS_DIEPMSK_INEMNEM_Pos       6
# define USBOTG_HS_DIEPMSK_INEMNEM_Msk       ((uint32_t)1 << USBOTG_HS_DIEPMSK_INEMNEM_Pos)
# define USBOTG_HS_DIEPMSK_TXFURM_Pos        8
# define USBOTG_HS_DIEPMSK_TXFURM_Msk        ((uint32_t)1 << USBOTG_HS_DIEPMSK_TXFURM_Pos)
# define USBOTG_HS_DIEPMSK_BIM_Pos           9
# define USBOTG_HS_DIEPMSK_BIM_Msk           ((uint32_t)1 << USBOTG_HS_DIEPMSK_BIM_Pos)

/* Device OUT endpoint common interrupt mask register */
# define USBOTG_HS_DOEPMSK_XFRCM_Pos        0
# define USBOTG_HS_DOEPMSK_XFRCM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPMSK_XFRCM_Pos)
# define USBOTG_HS_DOEPMSK_EPDM_Pos        1
# define USBOTG_HS_DOEPMSK_EPDM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPMSK_XXX_Pos)
# define USBOTG_HS_DOEPMSK_STUPM_Pos        3
# define USBOTG_HS_DOEPMSK_STUPM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPMSK_STUPM_Pos)
# define USBOTG_HS_DOEPMSK_OTEPDM_Pos        4
# define USBOTG_HS_DOEPMSK_OTEPDM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPMSK_OTEPDM_Pos)
# define USBOTG_HS_DOEPMSK_B2BSTUP_Pos        6
# define USBOTG_HS_DOEPMSK_B2BSTUP_Msk        ((uint32_t)1 << USBOTG_HS_DOEPMSK_B2BSTUP_Pos)
# define USBOTG_HS_DOEPMSK_OPEM_Pos        8
# define USBOTG_HS_DOEPMSK_OPEM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPMSK_OPEM_Pos)
# define USBOTG_HS_DOEPMSK_BOIM_Pos        9
# define USBOTG_HS_DOEPMSK_BOIM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPMSK_BOIM_Pos)

