wookey-project/libxDCI/include_frama/socs/stm32f439/usbotghs_regs.h
/* Device all endpoints interrupt register */
# define USBOTG_HS_DAINT_IEPINT(EP)        ((uint32_t)1 << (EP))
# define USBOTG_HS_DAINT_OEPINT(EP)        ((uint32_t)1 << ((EP) + 16))

/* Device all endpoints interrupt mask register */
# define USBOTG_HS_DAINTMSK_IEPM(EP)        ((uint32_t)1 << (EP))
# define USBOTG_HS_DAINTMSK_OEPM(EP)        ((uint32_t)1 << ((EP) + 16))

/* Device Vbus discharge time register */
# define USBOTG_HS_DVBUSDIS_VBUSDT_Pos        0
# define USBOTG_HS_DVBUSDIS_VBUSDT_Msk        ((uint32_t)0xffff << USBOTG_HS_DVBUSDIS_VBUSDT_Pos)

/* Device Vbus pulsing time register */
# define USBOTG_HS_DVBUSPULSE_DVBUSP_Pos        0
# define USBOTG_HS_DVBUSPULSE_DVBUSP_Msk        ((uint32_t)0xfff << USBOTG_HS_DVBUSPULSE_DVBUSP_Pos)

/* Device threshold control register */
# define USBOTG_HS_DTHRCTL_NONISOTHREN_Pos        0
# define USBOTG_HS_DTHRCTL_NONISOTHREN_Msk        ((uint32_t)1 << USBOTG_HS_DTHRCTL_NONISOTHREN_Pos)
# define USBOTG_HS_DTHRCTL_ISOTHREN_Pos        1
# define USBOTG_HS_DTHRCTL_ISOTHREN_Msk        ((uint32_t)1 << USBOTG_HS_DTHRCTL_ISOTHREN_Pos)
# define USBOTG_HS_DTHRCTL_TXTHRLEN_Pos        2
# define USBOTG_HS_DTHRCTL_TXTHRLEN_Msk        ((uint32_t)0x1ff << USBOTG_HS_DTHRCTL_TXTHRLEN_Pos)
# define USBOTG_HS_DTHRCTL_RXTHREN_Pos        16
# define USBOTG_HS_DTHRCTL_RXTHREN_Msk        ((uint32_t)1 << USBOTG_HS_DTHRCTL_RXTHREN_Pos)
# define USBOTG_HS_DTHRCTL_RXTHRLEN_Pos        17
# define USBOTG_HS_DTHRCTL_RXTHRLEN_Msk        ((uint32_t)0x1ff << USBOTG_HS_DTHRCTL_RXTHRLEN_Pos)
# define USBOTG_HS_DTHRCTL_ARPEN_Pos        27
# define USBOTG_HS_DTHRCTL_ARPEN_Msk        ((uint32_t)1 << USBOTG_HS_DTHRCTL_ARPEN_Pos)

/* Device IN EP FIFO empty interrupt mask register */
# define USBOTG_HS_DIEPEMPMSK_INEPTXFEM(EP)    ((uint32_t)1 << (EP))

/* Device each EP interrupt register */
# define USBOTG_HS_DEACHINT_IEP1INT_Pos        1
# define USBOTG_HS_DEACHINT_IEP1INT_Msk        ((uint32_t)1 << USBOTG_HS_DEACHINT_IEP1INT_Pos)
# define USBOTG_HS_DEACHINT_OEP1INT_Pos        17
# define USBOTG_HS_DEACHINT_OEP1INT_Msk        ((uint32_t)1 << USBOTG_HS_DEACHINT_OEP1INT_Pos)

/* Device each EP interrupt register mask */
# define USBOTG_HS_DEACHINTMSK_IEP1INTM_Pos    1
# define USBOTG_HS_DEACHINTMSK_IEP1INTM_Msk    ((uint32_t)1 << USBOTG_HS_DEACHINTMSK_IEP1INTM_Pos)
# define USBOTG_HS_DEACHINTMSK_OEP1INTM_Pos    17
# define USBOTG_HS_DEACHINTMSK_OEP1INTM_Msk    ((uint32_t)1 << USBOTG_HS_DEACHINTMSK_OEP1INTM_Pos)

/* Device each IN EP1 interrupt register */
# define USBOTG_HS_DIEPEACHMSK1_XFRCM_Pos        0
# define USBOTG_HS_DIEPEACHMSK1_XFRCM_Msk        ((uint32_t)1 << USBOTG_HS_DIEPEACHMSK1_XFRCM_Pos)
# define USBOTG_HS_DIEPEACHMSK1_EPDM_Pos        1
# define USBOTG_HS_DIEPEACHMSK1_EPDM_Msk        ((uint32_t)1 << USBOTG_HS_DIEPEACHMSK1_EPDM_Pos)
# define USBOTG_HS_DIEPEACHMSK1_TOM_Pos        3
# define USBOTG_HS_DIEPEACHMSK1_TOM_Msk        ((uint32_t)1 << USBOTG_HS_DIEPEACHMSK1_TOM_Pos)
# define USBOTG_HS_DIEPEACHMSK1_ITTXFEMSK_Pos    4
# define USBOTG_HS_DIEPEACHMSK1_ITTXFEMSK_Msk    ((uint32_t)1 << USBOTG_HS_DIEPEACHMSK1_ITTXFEMSK_Pos)
# define USBOTG_HS_DIEPEACHMSK1_INEPNMM_Pos    5
# define USBOTG_HS_DIEPEACHMSK1_INEPNMM_Msk    ((uint32_t)1 << USBOTG_HS_DIEPEACHMSK1_INEPNMM_Pos)
# define USBOTG_HS_DIEPEACHMSK1_INEPNEM_Pos    6
# define USBOTG_HS_DIEPEACHMSK1_INEPNEM_Msk    ((uint32_t)1 << USBOTG_HS_DIEPEACHMSK1_INEPNEM_Pos)
# define USBOTG_HS_DIEPEACHMSK1_TXFURM_Pos        8
# define USBOTG_HS_DIEPEACHMSK1_TXFURM_Msk        ((uint32_t)1 << USBOTG_HS_DIEPEACHMSK1_TXFURM_Pos)
# define USBOTG_HS_DIEPEACHMSK1_BIM_Pos        9
# define USBOTG_HS_DIEPEACHMSK1_BIM_Msk        ((uint32_t)1 << USBOTG_HS_DIEPEACHMSK1_BIM_Pos)
# define USBOTG_HS_DIEPEACHMSK1_NAKM_Pos        13
# define USBOTG_HS_DIEPEACHMSK1_NAKM_Msk        ((uint32_t)1 << USBOTG_HS_DIEPEACHMSK1_NAKM_Pos)

/* Device each OUT EP1 interrupt register */
# define USBOTG_HS_DOEPEACHMSK1_XFRCM_Pos        0
# define USBOTG_HS_DOEPEACHMSK1_XFRCM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPEACHMSK1_XFRCM_Pos)
# define USBOTG_HS_DOEPEACHMSK1_EPDM_Pos        1
# define USBOTG_HS_DOEPEACHMSK1_EPDM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPEACHMSK1_EPDM_Pos)
# define USBOTG_HS_DOEPEACHMSK1_AHBERRM_Pos    2
# define USBOTG_HS_DOEPEACHMSK1_AHBERRM_Msk    ((uint32_t)1 << USBOTG_HS_DOEPEACHMSK1_AHBERRM_Pos)
# define USBOTG_HS_DOEPEACHMSK1_OPEM_Pos        8
# define USBOTG_HS_DOEPEACHMSK1_OPEM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPEACHMSK1_OPEM_Pos)
# define USBOTG_HS_DOEPEACHMSK1_BIM_Pos        9
# define USBOTG_HS_DOEPEACHMSK1_BIM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPEACHMSK1_BIM_Pos)
# define USBOTG_HS_DOEPEACHMSK1_BERRM_Pos        12
# define USBOTG_HS_DOEPEACHMSK1_BERRM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPEACHMSK1_BERRM_Pos)
# define USBOTG_HS_DOEPEACHMSK1_NAKM_Pos        13
# define USBOTG_HS_DOEPEACHMSK1_NAKM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPEACHMSK1_NAKM_Pos)
# define USBOTG_HS_DOEPEACHMSK1_NYETM_Pos        9
# define USBOTG_HS_DOEPEACHMSK1_NYETM_Msk        ((uint32_t)1 << USBOTG_HS_DOEPEACHMSK1_NYETM_Pos)

/* Device control IN endpoint X control register */
#define USBOTG_HS_DIEPCTL_MPSIZ_Pos(EP)    0
#define USBOTG_HS_DIEPCTL_MPSIZ_Msk(EP)    ((EP) > 0 ? ((uint32_t)0x7ff << USBOTG_HS_DIEPCTL_MPSIZ_Pos(EP)) \
                     : ((uint32_t)0x3 << USBOTG_HS_DIEPCTL_MPSIZ_Pos(EP)))

# define USBOTG_HS_DIEPCTL_USBAEP_Pos        15
# define USBOTG_HS_DIEPCTL_USBAEP_Msk        ((uint32_t)1 << USBOTG_HS_DIEPCTL_USBAEP_Pos)
# define USBOTG_HS_DIEPCTL_DPID_Pos        16 /* applies to isochronous IN EP */
# define USBOTG_HS_DIEPCTL_DPID_Msk        ((uint32_t)1 << USBOTG_HS_DIEPCTL_DPID_Pos)
# define USBOTG_HS_DIEPCTL_EONUM_Pos        16 /* applies to interrupt/bulk IN EP */
# define USBOTG_HS_DIEPCTL_EONUM_Msk        ((uint32_t)1 << USBOTG_HS_DIEPCTL_DPID_Pos)
# define USBOTG_HS_DIEPCTL_NAKSTS_Pos        17
# define USBOTG_HS_DIEPCTL_NAKSTS_Msk        ((uint32_t)1 << USBOTG_HS_DIEPCTL_NAKSTS_Pos)
# define USBOTG_HS_DIEPCTL_EPTYP_Pos        18
# define USBOTG_HS_DIEPCTL_EPTYP_Msk        ((uint32_t)0x3 << USBOTG_HS_DIEPCTL_EPTYP_Pos)
#    define USBOTG_HS_DIEPCTL_EPTYP_CONTROL    0
#    define USBOTG_HS_DIEPCTL_EPTYP_ISOCHRO    1
#    define USBOTG_HS_DIEPCTL_EPTYP_BULK    2
#    define USBOTG_HS_DIEPCTL_EPTYP_INT        3
# define USBOTG_HS_DIEPCTL_STALL_Pos        21
# define USBOTG_HS_DIEPCTL_STALL_Msk        ((uint32_t)1 << USBOTG_HS_DIEPCTL_STALL_Pos)
# define USBOTG_HS_DIEPCTL_TXFNUM_Pos        22
# define USBOTG_HS_DIEPCTL_TXFNUM_Msk        ((uint32_t)0xf << USBOTG_HS_DIEPCTL_TXFNUM_Pos)
# define USBOTG_HS_DIEPCTL_CNAK_Pos        26
# define USBOTG_HS_DIEPCTL_CNAK_Msk        ((uint32_t)1 << USBOTG_HS_DIEPCTL_CNAK_Pos)
# define USBOTG_HS_DIEPCTL_SNAK_Pos        27
# define USBOTG_HS_DIEPCTL_SNAK_Msk        ((uint32_t)1 << USBOTG_HS_DIEPCTL_SNAK_Pos)
# define USBOTG_HS_DIEPCTL_SD0PID_Pos        28
# define USBOTG_HS_DIEPCTL_SD0PID_Msk        ((uint32_t)1 << USBOTG_HS_DIEPCTL_SD0PID_Pos)
# define USBOTG_HS_DIEPCTL_SD1PID_Pos           29
# define USBOTG_HS_DIEPCTL_SD1PID_Msk           ((uint32_t)1 << USBOTG_HS_DIEPCTL_SD1PID_Pos)
# define USBOTG_HS_DIEPCTL_EPDIS_Pos        30
# define USBOTG_HS_DIEPCTL_EPDIS_Msk        ((uint32_t)1 << USBOTG_HS_DIEPCTL_EPDIS_Pos)
# define USBOTG_HS_DIEPCTL_EPENA_Pos        31
# define USBOTG_HS_DIEPCTL_EPENA_Msk        ((uint32_t)1 << USBOTG_HS_DIEPCTL_EPENA_Pos)

