wookey-project/libxDCI/include_frama/socs/stm32f439/usbotghs_regs.h
/* Device OUT enpoint 0 transfer size register */
# define USBOTG_HS_DOEPTSIZ_XFRSIZ_Pos(EP)        0
# define USBOTG_HS_DOEPTSIZ_XFRSIZ_Msk(EP)        ((EP) > 0 ? ((uint32_t)0x7ffff << USBOTG_HS_DOEPTSIZ_XFRSIZ_Pos(EP)) \
                        : ((uint32_t)0x7f << USBOTG_HS_DOEPTSIZ_XFRSIZ_Pos(EP)))
# define USBOTG_HS_DOEPTSIZ_PKTCNT_Pos(EP)        19
# define USBOTG_HS_DOEPTSIZ_PKTCNT_Msk(EP)        ((EP) > 0 ? ((uint32_t)0x3ff << USBOTG_HS_DOEPTSIZ_PKTCNT_Pos(EP)) \
                        : ((uint32_t)1 << USBOTG_HS_DOEPTSIZ_PKTCNT_Pos(EP)))
# define USBOTG_HS_DOEPTSIZ_STUPCNT_Pos        29 /* Applies to control OUT EP */
# define USBOTG_HS_DOEPTSIZ_STUPCNT_Msk        ((uint32_t)3 << USBOTG_HS_DOEPTSIZ_STUPCNT_Pos)
# define USBOTG_HS_DOEPTSIZ_RXDPID_Pos        29 /* Applies to isochronous OUT EP */
# define USBOTG_HS_DOEPTSIZ_RXDPID_Msk        ((uint32_t)3 << USBOTG_HS_DOEPTSIZ_RXDPID_Pos)

/* Device EPx DMA address register */
# define USBOTG_HS_DOEPDMA_DMAADDR_Pos        0
# define USBOTG_HS_DOEPDMA_DMAADDR_Msk        ((uint32_t)0xffffffff << USBOTG_HS_DOEPDMA_DMAADDR_Pos)

/* Power and clock gating control register */
# define USBOTG_HS_PCGCCTL_STPPCLK_Pos        0
# define USBOTG_HS_PCGCCTL_STPPCLK_Msk        ((uint32_t)1 << USBOTG_HS_PCGCCTL_STPPCLK_Pos)
# define USBOTG_HS_PCGCCTL_GATEHCLK_Pos        1
# define USBOTG_HS_PCGCCTL_GATEHCLK_Msk        ((uint32_t)1 << USBOTG_HS_PCGCCTL_GATEHCLK_Pos)
# define USBOTG_HS_PCGCCTL_PHYSUSP_Pos        4
# define USBOTG_HS_PCGCCTL_PHYSUSP_Msk        ((uint32_t)1 << USBOTG_HS_PCGCCTL_PHYSUSP_Pos)

/* GPIO definitions for ULPI Mode */
# define GPIO_AF10_OTG_HS      10
/* GPIO A */
# define ULPI_D0_PIN           3
# define ULPI_CLK_PIN          5
/* GPIO B */
# define ULPI_D1_PIN           0
# define ULPI_D2_PIN           1
# define ULPI_D7_PIN           5
# define ULPI_D3_PIN           10
# define ULPI_D4_PIN           11
# define ULPI_D5_PIN           12
# define ULPI_D6_PIN           13
/* GPIO C */
# define ULPI_STP_PIN          0
# define ULPI_DIR_PIN          2
# define ULPI_NXT_PIN          3

#endif /* STM32F4XX_USBOTG_HS_REGS_H */
